org/blog.org
#+title: ORG Content
#+author: Victor Dorneanu
#+startup: indent fold
#+hugo_base_dir: ../
#+hugo_section: posts
#+hugo_auto_set_lastmod: t
#+hugo_paired_shortcodes: %sidenote
#+property: header-args :eval never-export

#+macro: zk [[https://brainfck.org/#$1][$2]]
#+macro: bib [[https://brainfck.org/bib.html#$1][$2]]
#+macro: relref @@hugo:[@@ $1 @@hugo:]({{< relref "$2" >}})@@
#+macro: titleref @@hugo:{{< titleref "$1" "@@ $2 @@hugo:" >}}@@


** emacs                                                                       :emacs:
:PROPERTIES:
:EXPORT_FILE_NAME: emacs
:END:

*** Topics
**** How to remove empty lines in region
- Select what you want to change, or C-x h to select the whole buffer.
- Then: ~M-x flush-lines RET~ followed by ~^$ RET~ or ~^[[ : space : ]]*$ RET~
- ~^[[ : space : ]]*$~ contain the meta-characters:
  - ^ for beginning of string,
  - $ for end of string,
**** Tag multiple headers in a region
- Select region
- run ~M-x org-change-tag-in-region~

**** Remove read-only lock in a buffer
~C-x C-q~
*** org-mode
- [[https://blog.lazkani.io/posts/text-editors/bookmark-with-org-capture/][Bookmark with Org-capture | The DevOps Blog]]
  How to capture links with own functions (for lisp beginners)

